import asyncio

from app.logics.summary.summary_generator import generate_summary
from app.models import SourceParagraph


async def main():
    result = await generate_summary(
        [
            SourceParagraph(
                "§ 1 Сознание человека. Мировоззрение и ценности",
                """\
На уроках обществознания в 9 классе мы обсуждали проявления един-
ства биологического и социального в человеке; развитие личности
и значение процессов социализации для индивида и общества. Сегодня
мы поговорим о сознании и мировоззрении человека.
КЛЮЧЕВЫЕ ПОНЯТИЯ
сознание
самосознание
мировоззрение
традиционные ценности
идеалы
убеждения
вера
СОЗНАНИЕ
Каждый из нас обладает сознанием. С точки зрения психологии
сознание человека — связанная с речью высшая функция мозга,
которая заключается в обобщённом и целенаправленном отраже-
нии действительности, планировании и прогнозировании челове-
ком возможных результатов своих действий, разумном самокон-
троле и самооценке.
В структуре сознания учёные выделяют осознание объектов,
процессов окружающего мира, связанное с мыслительными про-
цессами, с приобретением и систематизацией знаний о них. Зна-
ния о разных объектах могут быть более или менее глубокими,
более или менее системными в зависимости от познавательных
интересов человека, обстоятельств его жизни.
5
ЛИЧНОСТЬ В ИСТОРИИ
Лев Семёнович Выготский (1896—1934),
советский психолог и педагог, изучавший пробле-
мы развития сознания в контексте обучения
и воспитания. По его мнению, осознать что-
либо — значит приписать ему определённое
значение с помощью знаков, слов, речи, которые
сначала существуют на коллективном уровне,
а потом становятся личным достоянием индивида,
его психической функцией. Выготский совершил
открытия, которые перевернули представления
о детской психологии. Важной частью развития
он считал игру, уделял особое внимание детям
с особенностями развития, призывал педагогов
видеть в каждом из них не отдельные отличия,
а ребёнка, которого необходимо социализировать и учить наравне с другими.
«Важно не то, что ребёнок уже умеет, а то, чему он может на учиться», —
говорил он.
Есть также переживание, т. е. определённое отношение к объ-
екту, процессу. Например, в процессе просмотра нового фильма
мы осознаём его сюжет, делаем предположения о мотивах поступ-
ков героев, вспоминаем то, что знаем о режиссёре и его творче-
ском пути, актёрах и др. При этом мы сопереживаем одним геро-
ям, другие могут вызывать наше неприятие, фильм в целом может
показаться нам интересным или скучным, мы можем восхищаться
какими-то режиссёрскими или актёрскими приёмами.
Интересно, что в силу определённого отношения к познавае-
мым объектам знания о них имеют разную личностную значи-
мость. Например, знание человеком истории своей семьи проник-
нуто солидарностью, сопереживанием, любовью к своим близким,
гордостью за их достижения, стремлением эти достижения приум-
ножить. Всё это показывает особую ценность для человека знания
семейной истории. Эмоциональное отношение влияет на органи-
зацию нашей мысли, активность действий для достижения кон-
кретной цели.
Сознание человека не ограничивается познавательными про-
цессами и эмоциями. В основе всех психических процессов лежит
память — способность мозга запечатлевать, сохранять и воспро-
изводить информацию. Есть ещё воля — осознанная саморегуля-
ция человека и его способность управлять своими действиями.
Сознание человека не только отражает действительность, но
и может отрываться от неё. Так совершаются научные открытия,
создаются произведения искусства.
ТОЧКА ЗРЕНИЯ
Зигмунд Фрейд (1856—1939), австрийский нев-
ролог, основоположник психоанализа. В конце
XIX в. в понимании человеческой психики зароди-
лась мысль, что многие аспекты ментальной жиз-
ни обусловлены бессознательными процессами.
Исследования Фрейда, начиная с анализа сно-
видений и изучения невротических симптомов,
привели к формированию полноценной теоре-
тической системы — теории бессознательного.
Согласно ей, в психике человека далеко не всё
можно объяснить участием сознания. Например,
к формам проявления бессознательного относят
машинальные действия, а также интуицию. Бес-
сознательные процессы могут незаметно воздей-
ствовать на настроение и поведение.
Вы знаете, что каждый человек — личность, обладающая соб-
ственной индивидуальностью. Осознание человеком своих дей-
ствий, чувств, желаний, мотивов поведения, интересов, своего
положения в семье и обществе называется самосознанием. Само-
сознание предполагает отделение человеком себя от других людей
и систему его представлений о самом себе. Человек «считывает»
собственные мысли, ощущения собственного тела, эмоционально-
го состояния, движений, действий и др. На формирование самосо-
знания человека влияет и его окружение — оценки и сопоставле-
ния, требования и ожидания. По существу, самосознание человека
является залогом его жизни в обществе, поскольку обеспечивает
саморегулирование и самоконтроль, принятие на себя ответствен-
ности за свои действия.
Размышления человека о самом себе, своих жизненных целях,
планах, поступках, смысле собственного бытия учёные называют
рефлексией. Осмысляя и оценивая себя, человек получает возмож-
ность развиваться, совершенствоваться.
Каждый человек обладает индивидуальным сознанием. Кроме
индивидуального, учёные иногда говорят об общественном созна-
нии, имея в виду наиболее значимые для представителей конкрет-
ного общества ценности (о которых мы поговорим дальше), идеи,
представления и верования.
МИРОВОЗЗРЕНИЕ
Важным проявлением сознания является мировоззрение —
обобщённая система взглядов человека (и общества) на мир в це-
лом, на своё место в нём, понимание и оценка человеком смысла
своей жизни и деятельности, судеб человечества. Мировоззрение
существует как совокупность научных, социально-политических,
правовых, нравственных, религиозных, эстетических ценностных
ориентиров, верований, убеждений, идеалов и выражается через
образ жизни человека (и общества). Мировоззрение формируется
под воздействием конкретных жизненных обстоятельств, ближай-
шего окружения человека, воспитания и образования, т. е. оно
всегда привязано к окружающей действительности.
Любой предмет, событие имеют определённую ценность, зна-
чимость для конкретного человека, группы, общества в целом.
Разные предметы, события имеют неодинаковую значимость.
Какие-то ценности связаны с владением жизненными благами,
властью, высоким положением в обществе. К высшим ценностям
принято относить то, что определяет смысл человеческой жизни,
признаётся священным, обладающим высочайшей степенью важ-
ности и обязательности. Таковы, например, известные вам тра-
диционные ценности российского общества — нравственные
ориентиры, формирующие мировоззрение, передаваемые от поко-
ления к поколению, лежащие в основе общероссийской граждан-
ской идентичности и единого культурного пространства нашей
страны, укрепляющие гражданское единство, нашедшие своё
уникальное, самобытное проявление в духовном, историческом
и культурном развитии многонационального народа России.
Называя эти ценности традиционными, мы подчёркиваем, что
их формирование происходило в процессе возникновения, ста-
новления и развития Российского государства на протяжении
столетий. Эти ценности — результат многовекового исторического
и духовно-политического развития нашего общества. Сегодня
в России традиционные ценности защищаются на государствен-
ном уровне.
ВАЖНО
К традиционным ценностям российского общества относят-
ся жизнь, достоинство, права и свободы человека, патриотизм,
гражданственность, служение Отечеству и ответственность за
его судьбу, высокие нравственные идеалы, крепкая семья,
созидательный труд, приоритет духовного над материальным,
гуманизм, милосердие, справедливость, коллективизм, взаимо-
помощь и взаимоуважение, историческая память и преемствен-
ность поколений, единство народов России.
Традиционные ценности помогают нам осознать единство и не-
прерывность российской истории как процесса, в котором каждое
событие становится следствием предшествующих и формирует
предпосылки для будущего. Это обеспечивает связь между про-
шлым, настоящим и будущим нашей страны, общества в целом
и каждого человека в отдельности. Каждое новое поколение рос-
сиян приобщается к этим ценностям, наполняет их собственными
смыслами.
Каждый человек по-своему относится к ценностям того или ино-
го рода. И это отношение составляет его ценностные ориентиры.
Семейные ценности — это то, что объединяет людей
в семье: взаимная любовь, доверие, уважение, желание
оберегать и заботиться, проявлять доброту и сострада-
ние. Это также обычаи и традиции, которые передаются
из поколения в поколение, и всё то, что люди переживают
вместе внутри своего дома — радость и горе, благополу-
чие и трудности.
9
Они проявляются как мировоззренческие пози-
ции в отношении к искусству, морали, религии,
науке. Например, определяющую роль в жизни
верующего человека играет религия, и религи-
озные ценности становятся для него высшими
ценностями. Человек, посвятивший себя науке,
высшими ценностями видит истину, свободу
научного поиска, самоотверженность и чест-
ность учёного.
Истинная сущность личности определяется не отдельными
качествами и поступками, а преобладающими ценностными ори-
ентирами, убеждениями и интересами, которые становятся важ-
нейшей частью идентичности. В ответе на вопрос «Кто я?»
раскрывается в первую очередь самоопределение человека по
отношению к системе ценностей.
Возможно ли, чтобы человек в своей жизни ни во что не верил?
Наверное, нет. Речь не только о вере в Бога, которая облагоражива-
ет и возвышает человека. Человек верит в себя и способность изме-
нить собственную жизнь и жизнь других людей или, например,
в определённую модель будущего состояния общества.
Вера — глубокое, искреннее, пронизанное эмоциями принятие
какого-то положения или представления, иногда предполагающее
определённые рациональные основания, но обычно обходящееся
без них. Вера в свои силы — внутреннее убеждение человека в соб-
ственной способности справляться с трудностями, преодолевать
препятствия и достигать поставленных целей, опираясь на имею-
щиеся у него знания, навыки, опыт и внутренние ресурсы.
Идеалы как высшие цели, к которым стремятся люди, высший
смысл их деятельности, духовных устремлений, как наиболее
совершенные воплощения чего-либо — важная составляющая
мировоззрения. Социальный идеал — мечта о совершенном
устройстве общества, о гармонично развитой личности, в полной
мере реализующей свои возможности на благо человечества.
Убеждения — это устойчивая система взглядов человека,
в которой объединяются его разум, воля и чувства. Убеждения
составляют стержень мировоззрения и духовное ядро личности.
Истории известно множество случаев, когда следование своим
убеждениям позволяло людям преодолеть утрату жизненных
удобств, физическую немощь, страх смерти. (Вспомните подобные
случаи из российской истории.) Однако бывает, что реальные
поступки человека противоречат его убеждениям. Он может
действовать под влиянием эмоций, увлечений, модных тенденций
или мнений авторитетов. Нравственные переживания, раскаяние
в подобном случае становятся источником духовного роста.
МУДРЫЕ МЫСЛИ
«Для россиян, для России вопросы „Кто
мы?“, „Кем мы хотим быть?“ звучат в на-
шем обществе всё громче и громче. Очевид-
но, что наше движение вперёд невозможно
без духовного, культурного, национального
самоопределения, иначе мы не сможем про-
тивостоять внешним и внутренним вызо-
вам, не сможем добиться успеха в условиях
глобальной конкуренции».
В. В. Путин, 2013 г.
КАК ФОРМИРУЕТСЯ МИРОВОЗЗРЕНИЕ?
Обыденное мировоззрение, присущее каждому человеку, форми-
руется естественным образом в процессе социализации и повсе-
дневной жизни. Ключевую роль здесь играет освоение родного язы-
ка и культуры. В детстве, слушая сказки или заучивая народные
пословицы и поговорки, мы впитываем традиции мышления и цен-
ности своего народа. Мудрость, заключённая в таких выражениях,
как «Не хлебом единым жив человек» или «Не зная броду, не суйся
в воду», становится неотъемлемой частью нашего мировоззрения.
Общение с родителями, сверстниками, знания, получаемые
в школе, опыт, приобретаемый при решении элементарных жиз-
ненных задач, а также в соприкосновении с природой, искус-
ством, — всё это влияет на ценностные установки и убеждения
человека. В итоге, вступая в период юности, молодой человек
уже обладает вполне сформировавшимся мировоззрением, кото-
рое впоследствии развивается и трансформируется на протяжении
всей его жизни благодаря образованию и жизненному опыту.
Определяющую роль в формировании мировоззрения играет
повседневная деятельность человека. Открывая те или иные свой-
ства вещей или явлений, мы выделяем для себя некоторые из них.
Они и образуют основное содержание наших личных представле-
ний об окружающем мире.
Далеко не каждый из нас осознаёт и может изложить свои жиз-
ненные принципы в виде целостной системы: обыденное миро-
воззрение нередко ограниченно, фрагментарно, часто состоит из
смутных идей, разрозненных образов, эмоциональных пережива-
ний, которые не всегда удаётся чётко и развёрнуто сформулировать.
Наряду с обыденными представлениями об окружающем мире
и человеке, мировоззрение может включать различные суеверия,
стереотипы, предрассудки и т. п.
В древние времена мифы играли ключевую роль в формирова-
нии целостного представления о мире и месте человека в нём. Эти
образные истории, передаваемые в сказочной и аллегорической
форме, рассказывали о происхождении природы и человечества,
объясняли связи между различными вещами и явлениями. Одной
из особенностей древних легенд, сказаний и мифов являлось то,
что природные явления описывались в контексте человеческих
качеств и общественных отношений. Мифы вплетались в обыден-
ные представления людей, придавая им большую целостность,
и становились основой мифологического мировоззрения. При
этом формируемая массовой культурой и массмедиа современная
мифология выполняет ту же роль в трансформации обыденных
представлений наших современников.
Существенно большей системностью обладает религиозное
мировоззрение. Религия предлагает верующим определённую карти-
ну прошлого, настоящего и будущего, даёт ответ на вопросы о про-
исхождении мира и человека, о смысле человеческой жизни. В ре-
лигиозном мировоззрении по сути объединяются наши представле-
ния о природе и обществе с миром сверхъестественного. Благодаря
вере обязанности человека, его морально-нравственные установки
приобретают огромную силу, будучи представлены нам как Божья
воля. Поэтому религиозные убеждения оказывают особое влияние
на все стороны повседневной жизни и деятельности верующих.
В эпоху Античности появился философский и научный типы
мировоззрения. Его основные отличия от религиозного мировоз-
зрения связаны с наличием критического, т. е. требующего обо-
снования и подтверждения, отношения к любым утверждениям,
догматам, переходом от чувственных образов к абстрактным поня-
тиям. При этом философские концепции предлагались не в каче-
стве догм, которые следует принимать на веру, а как один из воз-
можных инструментов понимания и объяснения окружающего
мира. Философское мировоззрение предполагает постоянное дви-
жение, развитие человеческого сознания. Первоначально филосо-
фия включала все известные на тот момент научные знания —
математические, астрономические, медицинские. Уже в эту эпоху
были заложены основы большинства наук о природе, обществе
и человеке, получившие развитие в последующие века.
Научное мировоззрение включает в себя научную картину мира,
т. е. систему взглядов на мир, основанную на научных знаниях
и методах исследования. При этом научное мировоззрение изме-
няется от эпохи к эпохе.
ПРОВЕРЯЕМ СЕБЯ
1. Что такое сознание? Какие компоненты сознания выделяют учёные? 2. Что
такое мировоззрение? 3. На примере традиционных ценностей российского
общества охарактеризуйте высшие ценности. 4. Что такое идеал? Приведите
примеры идеалов. 5. Какую роль в мировоззрении и практической деятельности
человека играют убеждения? 6. Какие типы мировоззрения существуют? Дайте
краткую характеристику каждого из них.
ИССЛЕДУЕМ
7. Подумайте, какие ценности являются наиболее значимыми лично для вас.
Составьте иерархию из 10 таких ценностей, ранжировав их по степени личной
значимости. Объясните свой выбор.
РАССУЖДАЕМ
8. Проанализируйте каждое из приведённых высказываний А. Эйнштейна.
Объясните смысл каждого высказывания, выразите и обоснуйте своё отношение
к мнению автора.
«Наш мир относителен, его реальность зависит от нашего сознания».
«Настоящий прогресс человечества зависит не столько от изобретательного
ума, сколько от сознательности».
""",
            )
        ]
    )
    print(result.summary_block)
    print("-" * 80)
    print(result.information_block)


if __name__ == "__main__":
    asyncio.run(main())
